<a href="https://colab.research.google.com/github/ucr-courses/lab-session-1/blob/main/Knn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [5]:
# prompt: simulate a 100 row dataset with two variables price and year

df <- data.frame(
  price = rnorm(100, mean = 100, sd = 15),
  year = sample(2000:2023, 100, replace = TRUE)
)

In [6]:
head(df)

  price     year
1  73.37891 2016
2 136.56682 2002
3  87.75861 2019
4  78.17893 2003
5 115.66796 2014
6  93.70230 2014

In [7]:
df$Education <- df$price+60